app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "desc", "email", "first", "last", "password_digest", "role", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@user = User.new(params[:user])
    @admin_password = AdminPassword.new(params[:admin_password])
    @user.valid?
  	if @admin_password.valid? and @user.save